app/controllers/admin/users_controller.rb

SELECT * FROM `ci_users` WHERE (`ci_users`.`user_id` = 4) LIMIT 1
---
  def activate
    @user = User.find(params[:id])

INSERT INTO `ci_users` (`salt`, `last_login_at`, `activated_at`, `updated_at`, `crypted_password`, `deleted_at`, `admin`, `activation_code`, `remember_token_expires_at`, `password_reset_code`, `remember_token`, `person_id`, `email`, `state`, `created_at`) VALUES('0ab40b75b6c94d3b07f8c43342aca4fe326504ce', NULL, NULL, '2008-12-16 22:55:59', 'd29b263aae851c5a49da62d8c9a4f191ca9604f9', NULL, 0, NULL, NULL, NULL, NULL, 15003, 'admin_users_create@contactquarterly.com', 'passive', '2008-12-16 22:55:59')
---
  def create
    @user = User.new(params[:user])
    @user.person = Person.new(params[:user][:person])

    if @user.valid?
      @user.save!

SELECT * FROM `ci_users` WHERE (email = 'quentin@contactimprov.org') AND (ci_users.state = 'active') LIMIT 1
UPDATE `ci_users` SET `last_login_at` = '2008-12-16 22:41:34', `updated_at` = '2008-12-16 22:41:34' WHERE `user_id` = 1
---
  def edit
    #  TODO: Most of this code is duplicated from /user/edit - refactor to minimize duplication
    @priority_countries = ["United States", "Austria", "Brazil", "Canada", "France",
      "Germany", "Italy", "Spain", "Switzerland", "United Kingdom"]

    @user = User.find(params[:id])

    if request.put?
      @user.person.attributes = params[:user][:person]
      # if @user.subscriber_address
      #   @user.subscriber_address.initialize_from_params(params[:user][:subscriber_address])
      #   @user_submitted_unknown_country_name = !@user.subscriber_address.country_name ? true : false
      # end

      if @user.valid?
        @user.person.save!

SELECT * FROM `ci_users` WHERE (`ci_users`.`user_id` = 4)
---
  def list
    @users = User.find(:all)

SELECT * FROM `ci_users` WHERE (`ci_users`.`user_id` = 4)
---
  def list_active
    @users = User.find(:all, :conditions => "state = 'active'")

SELECT * FROM `ci_users` WHERE (`ci_users`.`user_id` = 4)
---
  def list_pending
    @users = User.find(:all, :conditions => "state = 'pending'")

SELECT * FROM `ci_user_account_requests` WHERE (`ci_user_account_requests`.`user_account_request_id` = 1)
UPDATE `ci_user_account_requests` SET `ci_notes` = 'updated_notes', `updated_at` = '2008-12-16 22:43:49' WHERE `user_account_request_id` = 1
UPDATE `ci_users` SET `last_login_at` = '2008-12-16 22:41:34', `updated_at` = '2008-12-16 22:41:34' WHERE `user_id` = 1
---
  def process_account_request
    if request.put?
      account_request = UserAccountRequest.find(params[:account_request_id])
      account_request.attributes = params[:user_account_request]

      #  Because the 'ci_notes' field is not attr_accessible, it won't be
      #   assigned a value when using attributes= for mass assignment
      account_request.ci_notes = params[:user_account_request][:ci_notes]

      if params[:commit] == 'Accept'
        account_request.accept!
        account_request.create_user_account_and_deliver_signup_email
      elsif params[:commit] == 'Reject'
        account_request.reject!
      # else just save the CQ comments without updating the state
      end

      account_request.save!

SELECT * FROM `ci_users` WHERE (`ci_users`.`user_id` = 4) LIMIT 1
UPDATE `ci_users` SET `crypted_password` = 'c1569e0933a24b02c434c82e17fb8f62f708e2e3', `updated_at` = '2008-12-16 22:41:34' WHERE `user_id` = 1
---
  def reset_password
    @user = User.find(params[:id])

    if request.post? && @user
      @user.attributes = params[:user]
      if @user.valid?
        @user.save!

SELECT * FROM `ci_users` WHERE (email = 'quentin@contactimprov.org') AND (ci_users.state = 'active') LIMIT 1
---
  def find_user
    @user = User.find(params[:id])