app/controllers/admin/users_controller.rb

SELECT `ci_users`.* FROM `ci_users` INNER JOIN ci_people ON ci_users.person_id = ci_people.person_id WHERE (LOWER(first_name) LIKE '%cr%' OR LOWER(last_name) LIKE '%cr%') ORDER BY last_name ASC LIMIT 20
---
  def auto_complete_for_user_by_person
    users = User.find(:all,
      :conditions => [ "LOWER(first_name) LIKE ? OR LOWER(last_name) LIKE ?",
        '%' + params[:user][:by_person] + '%',
        '%' + params[:user][:by_person] + '%'],
      :limit => 20,
      :joins => 'INNER JOIN ci_people ON ci_users.person_id = ci_people.person_id',
      :order => 'last_name ASC')

SELECT count(*) AS count_all FROM `ci_users` WHERE (state = 'active')
SELECT * FROM `ci_users` WHERE (`ci_users`.`user_id` = 15000) LIMIT 1
SELECT count(*) AS count_all FROM `ci_user_account_requests` WHERE (state ='new')
---
  def index
    @total_users            = User.count
    @total_active_users     = User.count :conditions => "state = 'active'"
    @total_pending_users    = User.count :conditions => "state = 'pending'"
    @total_new_account_requests = UserAccountRequest.count :conditions => "state ='new'"

SELECT * FROM `ci_users` WHERE (`ci_users`.`user_id` = 15000) LIMIT 1
SELECT * FROM `ci_users`
---
  def list
    @users = User.find(:all)
    @total_users = @users.size

SELECT * FROM `ci_user_account_requests` WHERE (state = "accepted")
SELECT * FROM `ci_user_account_requests` WHERE (state = "new")
SELECT * FROM `ci_user_account_requests` WHERE (state = "rejected")
---
  def list_account_requests
    @account_requests          = UserAccountRequest.find(:all)
    @accepted_account_requests = UserAccountRequest.find(:all, :conditions => 'state = "accepted"')
    @new_account_requests      = UserAccountRequest.find(:all, :conditions => 'state = "new"')
    @rejected_account_requests = UserAccountRequest.find(:all, :conditions => 'state = "rejected"')

SELECT * FROM `ci_users` WHERE (`ci_users`.`user_id` = 15000) LIMIT 1
---
  def list_active
    @users = User.find(:all, :conditions => "state = 'active'")

SELECT * FROM `ci_users` WHERE (`ci_users`.`user_id` = 15000) LIMIT 1
---
  def list_pending
    @users = User.find(:all, :conditions => "state = 'pending'")

SELECT * FROM `ci_locations` WHERE (geocode_precision IS NOT NULL)
---
  def map
    @locations = Location.find(:all, :conditions => "geocode_precision IS NOT NULL")

SELECT * FROM `ci_user_account_requests` WHERE (`ci_user_account_requests`.`user_account_request_id` = 15000)
---
  def show_account_request
    @account_request = UserAccountRequest.find(params[:id])

SELECT * FROM `ci_users` WHERE (`ci_users`.`user_id` = 15000) LIMIT 1
---
  def find_user
    @user = User.find(params[:id])