app/controllers/event_controller.rb

  def create
    create_event_and_linked_models

    initialize_event_and_linked_models_from_params(params)

    if event_and_linked_models_valid?
      delete_completely_blank_models
      @contact_event.owner_user = current_user
      @contact_event.save!
---
INSERT INTO `ci_contact_events` (`start_date`, `end_date`, `phone_number_id`, `url_id`, `email_id`, `ci_notes`, `updated_at`, `title`, `studio_id`, `location_id`, `version`, `subtitle`, `description`, `owner_user_id`, `company_id`, `person_id`, `created_at`) VALUES('2008-12-17', '2008-12-19', NULL, NULL, NULL, NULL, '2008-12-27 15:05:34', 'title', NULL, 15001, 1, 'subtitle', 'description', 15000, NULL, NULL, '2008-12-27 15:05:34')

  def edit
    if not params.has_key?(:id)
      # TODO: Rewrite error message to tell user to contact webmaster
      flash[:notice] = "<h2>Event not Found</h2><p>No Event ID was provided</p>"
      return
    end

    begin
      @contact_event = ContactEvent.find(params[:id])
    rescue ActiveRecord::RecordNotFound
      # TODO: Rewrite error message to tell user to contact webmaster
      flash[:notice] = "<h2>Event not Found</h2><p>Unable to find the Event you are searching for.</p>"
      return
    end

    if @contact_event.owner_user != current_user
      flash[:notice] = "<h2>Access Denied</h2><p>You do not have permission to edit this Event.</p>"
      return
    end

    @contact_event.email        ||= Email.new
    @contact_event.phone_number ||= PhoneNumber.new
    @contact_event.url          ||= Url.new

    if request.post?
      initialize_event_and_linked_models_from_params(params)

      if event_and_linked_models_valid?
        delete_completely_blank_models
        @contact_event.owner_user = current_user
        @contact_event.save!
---
SELECT * FROM `ci_contact_events` WHERE (`ci_contact_events`.`contact_event_id` = 15000)
INSERT INTO `ci_users` (`salt`, `last_login_at`, `activated_at`, `updated_at`, `crypted_password`, `deleted_at`, `admin`, `activation_code`, `remember_token_expires_at`, `password_reset_code`, `remember_token`, `person_id`, `email`, `state`, `created_at`) VALUES('09403c9df00c06099ce244b44b5020e47a720c89', NULL, NULL, '2008-12-27 18:40:53', '10194022fd63f1d0c54ea24eda26851f270b0499', NULL, 1, NULL, NULL, NULL, NULL, 15000, 'charman@acm.org', 'passive', '2008-12-27 18:40:53')
UPDATE `ci_users` SET `activated_at` = '2008-12-27 18:40:53', `state` = 'active', `updated_at` = '2008-12-27 18:40:53' WHERE `user_id` = 15000