app/controllers/sessions_controller.rb

SELECT `ci_users`.user_id FROM `ci_users` WHERE (LOWER(`ci_users`.`email`) = BINARY 'create_and_start_in_passive_state@contactimprov.org') LIMIT 1
---
  def create
    #  Check if an account with the given email address exists and is waiting to be activated
    if !params[:email].empty?
      params[:email] = params[:email].strip   # Remove leading/trailing whitespace
      user = User.find_by_email(params[:email])

INSERT INTO `ci_users` (`salt`, `last_login_at`, `activated_at`, `updated_at`, `crypted_password`, `deleted_at`, `admin`, `activation_code`, `remember_token_expires_at`, `password_reset_code`, `remember_token`, `person_id`, `email`, `state`, `created_at`) VALUES('cad4db5318ad012bf0638608df9ae75fa333419d', NULL, NULL, '2008-12-16 18:47:53', '33fa904fe850319db4847f0d6319cf88f4abed83', NULL, 0, NULL, NULL, NULL, NULL, NULL, 'create_and_start_in_passive_state@contactimprov.org', 'passive', '2008-12-16 18:47:53')
UPDATE `ci_users` SET `crypted_password` = '4b6dd603c64f03bc2f676658e287094878df9603', `updated_at` = '2008-12-16 18:47:54' WHERE `user_id` = 5
---
#        self.current_user.remember_me
#        cookies[:auth_token] = { :value => self.current_user.remember_token , :expires => self.current_user.remember_token_expires_at }
#      end
    if @user_session.save