app/controllers/sessions_controller.rb

SELECT * FROM `ci_users` WHERE (email = 'charman@acm.org') AND (ci_users.state = 'active') LIMIT 1
---
  def create
    #  Check if an account with the given email address exists and is waiting to be activated
    if !params[:email].empty?
      params[:email] = params[:email].strip   # Remove leading/trailing whitespace
      user = User.find_by_email(params[:email])

UPDATE `ci_users` SET `remember_token_expires_at` = '2009-01-09 21:19:18', `remember_token` = 'dd8ce4dead083a74f410d37d0bf6089a7a46dced', `updated_at` = '2008-12-26 21:19:18' WHERE `user_id` = 15000
---
#        self.current_user.remember_me
#        cookies[:auth_token] = { :value => self.current_user.remember_token , :expires => self.current_user.remember_token_expires_at }
#      end
    if @user_session.save