app/controllers/user_controller.rb

SELECT * FROM `ci_country_names` WHERE (LOWER(english_name) LIKE '%c%') ORDER BY english_name ASC LIMIT 10
---
  def auto_complete_for_country_name_english_name
    country_names = CountryName.find(:all,
      :conditions => [ "LOWER(english_name) LIKE ?", '%' + params[:term] + '%'],
      :limit => 20,
      :order => 'english_name'
    )

SELECT * FROM `ci_us_states` WHERE (LOWER(name) LIKE '%new%') ORDER BY name ASC LIMIT 10
---
  def auto_complete_for_us_state_name
    us_states = UsState.find(:all,
      :conditions => [ "LOWER(name) LIKE ?", '%' + params[:term] + '%'],
      :limit => 20,
      :order => 'name'
    )

SELECT * FROM `ci_emails` WHERE (1 = 1) ORDER BY position DESC LIMIT 1
SELECT * FROM `ci_users` WHERE (`ci_users`.`email` = 'todd@contactimprov.org') LIMIT 1
INSERT INTO `ci_emails` (`for_entity_id`, `updated_at`, `version`, `position`, `address`, `created_at`) VALUES(NULL, '2008-12-16 23:24:49', 1, 1, 'todd@contactimprov.org', '2008-12-16 23:24:49')
INSERT INTO `ci_user_account_requests` (`ci_notes`, `email_id`, `updated_at`, `location_id`, `person_id`, `state`, `created_at`) VALUES(NULL, 15000, '2008-12-16 23:24:49', NULL, 15002, 'new', '2008-12-16 23:24:49')
---
  def request_account
    @user_account_request = UserAccountRequest.new
    @uar_person   = Person.new
    @uar_email    = Email.new

    if request.post?
      @user_account_request.attributes   = params[:user_account_request]
      @uar_person.attributes             = params[:uar_person]
      @uar_email.attributes              = params[:uar_email]

      #  Validate each set of fields, regardless of whether or not the other sets are valid
      person_valid   = @uar_person.valid?
      email_valid    = @uar_email.valid?

      if @user_account_request.valid? && person_valid && email_valid
        user = User.find_by_email(params[:uar_email][:address])
        if user
          process_password_reset_request(user, params[:uar_email][:address])
        else
          @uar_person.save!
          @uar_person.reload                                 #  reload the Person object to retrieve its entity
#            @uar_email.for_entity_id = @uar_person.entity.id   #  email addresses must be linked to an entity
          @uar_email.save!

          @user_account_request.person   = @uar_person
          @user_account_request.email    = @uar_email
          @user_account_request.save!