app/controllers/user_controller.rb

SELECT * FROM `ci_users` WHERE (`ci_users`.`activation_code` = '670f357dbf05d7d87323e6f4a8922519327bcb2e') LIMIT 1
SELECT `ci_users`.user_id FROM `ci_users` WHERE (LOWER(`ci_users`.`email`) = BINARY 'passive_user@contactimprov.org' AND `ci_users`.user_id <> 5) LIMIT 1
---
  def activate
    #  [CTH]  This code originally had ':false' after the question mark, instead of 'nil',
    #          which was a complete bear to debug, as :false != false
    @user = params[:activation_code].blank? ? nil : User.find_by_activation_code(params[:activation_code])

    if @user && @user.state == 'active'
      # User has already been activated, so redirect on to original page
      # TODO: Do we really want to log the user on with just an activation code?  Now that the
      #        activation code is no longer being deleted on activation, it effectively becomes
      #        second password - but a password that the user cannot change.
      UserSession.create(@user)   # Log the user in
      redirect_back_or_home
      return
    end

    #  We may or may not already have an email address on file for this user.  But if
    #   they provided an email address on the login page, then we use this email
    #   address instead of the email address on file.
    if @user && !flash[:email].blank?

UPDATE `ci_users` SET `email` = 'new_email@contactimprov.org', `updated_at` = '2008-12-16 19:14:22' WHERE `user_id` = 1
---
  def change_email
    #  lemma: Because login_required is used as a before_filter for this action, the user is
    #          logged in, and current_user returns a valid User object.
    @user = current_user

    if request.post?
      if @user.authenticated?(params["password"])
        if params["email"] == params["email_confirmation"]
          old_email = @user.email
          @user.email = params["email"]

          if @user.valid?
            @user.save!

UPDATE `ci_users` SET `crypted_password` = 'c1569e0933a24b02c434c82e17fb8f62f708e2e3', `updated_at` = '2008-12-16 19:14:22' WHERE `user_id` = 1
---
  def change_password
    #  lemma: Because login_required is used as a before_filter for this action, the user is
    #          logged in, and current_user returns a valid User object.
    @user = current_user

    if request.post?
      if @user.authenticated?(params["old_password"])
        @user.password = params["password"]
        @user.password_confirmation = params["password_confirmation"]

        if @user.valid?
          @user.save!

SELECT `ci_users`.user_id FROM `ci_users` WHERE (LOWER(`ci_users`.`email`) = BINARY 'passive_user@contactimprov.org' AND `ci_users`.user_id <> 5) LIMIT 1
---
  def request_account
    @user_account_request = UserAccountRequest.new
    @uar_person   = Person.new
    @uar_email    = Email.new

    if request.post?
      @user_account_request.attributes   = params[:user_account_request]
      @uar_person.attributes             = params[:uar_person]
      @uar_email.attributes              = params[:uar_email]

      #  Validate each set of fields, regardless of whether or not the other sets are valid
      person_valid   = @uar_person.valid?
      email_valid    = @uar_email.valid?

      if @user_account_request.valid? && person_valid && email_valid
        user = User.find_by_email(params[:uar_email][:address])

SELECT `ci_users`.user_id FROM `ci_users` WHERE (LOWER(`ci_users`.`email`) = BINARY 'quentin@contactimprov.org' AND `ci_users`.user_id <> 1) LIMIT 1
---
  def request_password_reset
    if request.post?
      if params[:email].empty?
        flash.now[:notice] = "<h2>Problem resetting password</h2><p>You must provide an email address</p>"
        return
      elsif params[:email] != params[:email_confirmation]
        flash.now[:notice] = "<h2>Problem resetting password</h2><p>The email addresses you provided do not match</p>"
        return
      end

      @user = User.find_by_email(params[:email])

SELECT * FROM `ci_users` WHERE (`ci_users`.`password_reset_code` = 'f3f0edd703d16122eaf512714562646b9a3b42e7') LIMIT 1
UPDATE `ci_users` SET `crypted_password` = 'c1569e0933a24b02c434c82e17fb8f62f708e2e3', `password_reset_code` = NULL, `updated_at` = '2008-12-16 19:14:24' WHERE `user_id` = 1
---
  def reset_password
    if params.has_key?('password_reset_code')
      @user = User.find_by_password_reset_code(params[:password_reset_code])
    end

    if !@user
      flash.now[:notice] = '<h2>Invalid password reset code</h2>' +
                            '<p></p>'
      return
    end

    if request.post?
      #  TODO: Test that params["user"] exists...
      @user.password = params["user"]["password"]
      @user.password_confirmation = params["user"]["password_confirmation"]

      if @user.valid?
        @user.password_reset_code = nil
        @user.save!